[
  {
    "id":"60637926537492872ec05fe4",
    "name":"High Plank T-spine Rotation",
    "description":"Start in a push-up position with hands under the shoulders and the legs straightened directly behind the body about hip-width apart. Squeeze the thighs and glutes while straightening the right arm and pressing it into the floor. At the same time, lift the left hand up and twist the hips and shoulders to raise the left arm up towards the ceiling. Bring the left arm down, press the left hand into the floor, and twist the hips and shoulders to alternate sides, lifting the right hand into the air. Repeat for the desired number of repetitions.",
    "category":"Abs, Shoulders",
    "imagePrimary":"https://acewebcontent.azureedge.net/exercise-library/large/330-1.jpg",
    "imageSecondary":"https://acewebcontent.azureedge.net/exercise-library/large/330-2.jpg",
    "equipment":"No Equipment",
    "difficulty":"Advanced"
  },
  {
    "id":"60672ad0e4a7f029a4ae1594",
    "name":"Close-grip Bench Press",
    "description":"Place two cable pulleys slightly above the shoulder height with handle attachments, grip one handle in each hand and step forward so that the arms are outstretched to the sides. With the elbows slightly bent, slowly bring both hands together in front of the body. When the hands are together, pause for one second before slowly returning the arms to the starting position. ",
    "category":"Arms, Chest",
    "imagePrimary":"https://acewebcontent.azureedge.net/exercise-library/large/311-1.jpg",
    "imageSecondary":"https://acewebcontent.azureedge.net/exercise-library/large/311-2.jpg",
    "equipment":"Barbell",
    "difficulty":"Intermediate"
  },
  {
    "id":"60672e26e4a7f029a4ae1595",
    "name":"Lying Pullovers",
    "description":"Lie face up on a bench with the feet resting comfortably on the floor, and straighten the arms above the chest while holding one dumbbell in each hand with the palms facing each other. Slowly stretch the arms up overhead while keeping the elbows straight. Once the arms are overhead slowly pull the weights back up to the original starting position. Repeat for the desired number of repetitions.",
    "category":"Chest",
    "imagePrimary":"https://acewebcontent.azureedge.net/exercise-library/large/37-1.jpg",
    "imageSecondary":"https://acewebcontent.azureedge.net/exercise-library/large/37-2.jpg",
    "equipment":"Bench, Dumbbells",
    "difficulty":"Intermediate"
  },
  {
    "id":"60672ec6e4a7f029a4ae1596",
    "name":"Chest Press",
    "description":"Lie face up on a flat bench, and grip a barbell with the hands slightly wider than shoulder-width. Press the feet into the ground and the hips into the bench while lifting the bar off the rack. Slowly lower the bar to the chest by allowing the elbows to bend out to the side. Stop when the elbows are just below the bench, and press feet into the floor to press the weight straight up to return to the starting position.",
    "category":"Arms, Chest, Shoulders",
    "imagePrimary":"https://acewebcontent.azureedge.net/exercise-library/large/5-1.jpg",
    "imageSecondary":"https://acewebcontent.azureedge.net/exercise-library/large/5-2.jpg",
    "equipment":"Barbell, Bench",
    "difficulty":"Beginner"
  },
  {
    "id":"60672f70e4a7f029a4ae1597",
    "name":"Bent-over Row",
    "description":"Grip a barbell with palms down so that the wrists, elbows, and shoulders are in a straight line. Lift the bar from the rack, bend forward at the hips, and keep the back straight with a slight bend in the knees. Lower the bar towards the floor until the elbows are completely straight, and keep the back flat as the bar is pulled towards the belly button. Then slowly lower the bar to the starting position and repeat.",
    "category":"Arms, Back, Shoulders",
    "imagePrimary":"https://acewebcontent.azureedge.net/exercise-library/large/12-1.jpg",
    "imageSecondary":"https://acewebcontent.azureedge.net/exercise-library/large/12-2.jpg",
    "equipment":"Barbell",
    "difficulty":"Advanced"
  },
  {
    "id":"6068c45506ae0f1c783dedc1",
    "name": "Push Jerk",
    "description": "Place a barbell in a rack at approximately shoulder-height. Grip the bar with the hands about shoulder-width apart and dip under the bar to bring it off the rack. Step backwards with the bar resting across the front of the shoulders. The palms should be facing the ceiling and the elbows pointed straight ahead. Quickly bend the knees while keeping the back straight and the chest tall. Explosively drive the feet into the ground to send the bar directly upwards overhead. While driving the bar upwards, make a little jump and push body under the bar as it is moving upwards landing with the right foot forward and left leg behind (feet should remain approximately hip-width apart). The bar should finish its upward movement while the right leg is in a lunged position. Press the right foot into the floor and step back a half step, then step the left foot forward until both feet are in the same line, shoulder width apart, while holding the barbell overhead. Lower the bar to the shoulders and repeat.",
    "category": "Full Body/Integrated",
    "imagePrimary": "https://acewebcontent.azureedge.net/exercise-library/large/313-2.jpg",
    "imageSecondary": "https://acewebcontent.azureedge.net/exercise-library/large/313-3.jpg",
    "equipment": "Barbell",
    "difficulty": "Advanced"
  },
  {
    "id":"6068c4c106ae0f1c783dedc2",
    "name": "Roll Out",
    "description": "Place the barbell with appropriate weight on floor, kneel down facing the bar, and place the hands on the bar about shoulder-width apart. Keep the hips pressed forward and the back straight allowing the barbell to roll away from the body. Maintain the trunk position and pull down with the arms to move the bar towards the body and return to the starting position.",
    "category": "Abs",
    "imagePrimary": "https://acewebcontent.azureedge.net/exercise-library/large/309-5.jpg",
    "imageSecondary": "https://acewebcontent.azureedge.net/exercise-library/large/309-3.jpg",
    "equipment": "Barbell",
    "difficulty": "Advanced"
  },
  {
    "id":"6068c58206ae0f1c783dedc3",
    "name":"Seated Shoulder Press",
    "description":"Sit in a shoulder-press bench and rack, and keep the back straight while gripping the bar with the hands a little wider than shoulder-width apart. Take the bar out of the rack and slowly lower to the front of the shoulders, stopping when the bar is about chin-height. Press the feet into the floor, squeeze the stomach muscles, and keep the elbows pointed forward while pressing the bar directly overhead. Slowly lower the bar to chin-height and repeat for the desired number of repetitions.",
    "category":"Arms, Shoulders",
    "imagePrimary":"https://acewebcontent.azureedge.net/exercise-library/large/43-1.jpg",
    "imageSecondary":"https://acewebcontent.azureedge.net/exercise-library/large/43-2.jpg",
    "equipment":"Barbell, Bench",
    "difficulty":"Intermediate"
  }
]